[
  {
    "url": "https://jobs.ashbyhq.com/rillet/f5d21c85-4fd2-461b-b5aa-3ece7d9f6bac",
    "company": "Rillet",
    "job_title": "Senior Software Engineer",
    "location": "New York City, New York, United States",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": null,
    "date_posted": "2025-07-29",
    "description": "What We Do\nRillet serves finance teams. Our customers are the financial brains of their companies. Our job is to help them run the numbers with impossible speed, accuracy, and insight.\nRillet is an AI-native ERP that can drive a zero-day close. We are different because of our unified source-of-truth data model, hundreds of best-in-class native integrations (Stripe, Ramp, Salesforce, etc), automated & auditable workflows, multi-entity consolidation, and quickly expanding army of specialized AI agents (e.g., accrual, audit, P&L flux, board decks, etc). These earn us a consistently\nperfect customer satisfaction score\n. High-growth AI customers like Windsurf, Postscript, and Finch love our ship velocity, because their financial stack needs to scale as quickly as they do.\nThis huge market is ours to take. We have raised $100M from leading investors (including Sequoia, a16z, Iconiq, Oak HC/FT, and First Round) to\nhelp everyone run their numbers at the speed of AI.\nWho We Are\nRillet’s pace is not for everyone. Intelligence is table stakes. To succeed here, you need extreme speed, agency, and flexibility.\nSuccessful Rilleteers do not wait for assignments. They internalize a mission, design a strategy, and bring back results that are better, faster, and more creative than a manager could have asked for.\nWork revolves around our customers. Successful Rilleteers are energized by delivering the most important things, even those that weren’t in the original plan.\nIn this role, you do not need to be an accountant. But you do need to appreciate the value that our customers can create for their own company when we equip them with the perfect financial tools. Successful Rilleteers love powering the financial core of the world’s fastest-growing companies.\nWho We Need:\nWe’re looking for an experienced software engineer to work across the whole software lifecycle at Rillet. You’ll join a growing engineering team and work closely with the CTO, product, and design to build industry-defining accounting and finance software.\nWhile we offer flexible work arrangements, we have a preference for people excited about helping us build our presence in San Francisco Bay Area or New York City as we grow, whether that's through occasional office time, team gatherings, or local hiring efforts.\nWhat You'll Do:\nLead technical decisions across the infrastructure and software stack, driving architectural discussions and setting engineering standards\nShape Rillet's technical strategy and roadmap for years to come, identifying opportunities for innovation and scalability\nPartner with product managers, designers, and finance experts to influence product direction, advocate for technical trade-offs, and balance business needs with engineering excellence\nDrive customer research initiatives, translating user insights into technical requirements and advocating for the customer perspective in engineering decisions\nEstablish and champion continuous delivery practices, mentoring team members on deployment strategies and ensuring reliable, frequent releases\nLead by example in test-driven development and automation, building robust testing frameworks and fostering a quality-first culture\nOwn production reliability and operational excellence, designing monitoring solutions, leading incident response, and implementing proactive measures to ensure system stability\nMentor engineers on the team, conducting code reviews, and raising the technical bar across the organization\nWhat We're Looking For:\n5+ years of software engineering experience with a Bachelor's degree in Computer Science, including a proven track record leading large-scale projects and architecting scalable systems\nBackend focused full-stack engineer with proficiency in Kotlin, Java, or other JVM languages; experience with modern web frameworks and Typescript is a plus!\nExpertise in both object-oriented and functional programming approaches\nAbility to find practical solutions to real user problems without compromising on quality\nThrive independently and collaboratively within a small team, with a passion for continuous learning and knowledge sharing\nLife at Rillet:\nCompetitive Pay & Benefits:\nBacked by world-class investors, we offer strong salaries plus equity so you share in our success. We've got you covered with top-tier health and dental insurance, premiums partially or fully covered for you, plus 90% coverage for dependents.\nRoom to Grow:\nWe're building a team of ambitious, high-performing people who will grow with the company. As Rillet scales, so will your role, responsibilities, and compensation.\nFlexibility That Works:\nTake the time you need with flexible PTO and 9 company-wide holidays. We value both the flexibility of remote and hybrid work and the creativity and energy that comes from in-person collaboration at our hubs in San Francisco, NYC, and Barcelona.\nBuild Real Connections:\nGreat work happens when people connect. Join us for team offsites in incredible locations, our team has bonded everywhere from New York and San Francisco to Toronto, Italy, France, and beyond."
  },
  {
    "url": "https://jobs.ashbyhq.com/freshpaint/cae714e6-8ea6-43a5-8792-81beacd2f315",
    "company": "Freshpaint",
    "job_title": "Senior Software Engineer",
    "location": "USA",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": "$181,000 - $213,000 USD",
    "date_posted": "2025-06-30",
    "description": "About Freshpaint:\nCustomer data is the fuel that drives all modern businesses. From product analytics, to marketing, to support, to advertising, advanced data analysis in the warehouse, and even sales – customer data is the raw material for each function at a modern business.\nFor highly regulated businesses in healthcare, it’s always been a challenge to harness that customer data and get it to the marketing and analytics tools that require it\nwhile following patient privacy laws\n….until now.\nSomething as simple as running ads to get more users is simple for an e-commerce of software company to do. But common web analytics and advertising tools collect sensitive user identifiers and healthcare information automatically. Those same tools are not HIPAA compliant.\nWe provide a layer of data governance to make current web analytics tools HIPAA-compliant. For analytics, our customers can continue getting the insights they need to improve the patient experience. For marketing, Freshpaint safeguards health information while helping our customers promote access to care through popular advertising platforms like Facebook, Google, and others.\nIn short, we help healthcare marketers promote access to care\nand\nsafeguard patient privacy at the same time.\nThis is an important, complex problem in a massive market (healthcare is 20% of the US GDP).\nOur customers manage their customer data with:\nPrivacy Platform. We help healthcare providers automate their website’s + app’s HIPAA compliance, and safeguard patient data. This is our core product today\nFuture additional product lines! Our core product provides a platform that we're building marketing applications on top of.\nWe’re fully remote. If you strongly value in-person work, Freshpaint is likely not the best fit for you. Even though we don’t care where you’re located, we only hire within the US. Many of our team is concentrated in various metro areas like SF or NYC. To balance out our remote-ness, we gather the team 2x times per year for offsites. We’re backed by leading investors including Y-Combinator, Intel Capital, and angel investors like the Head of Data from Slack, Head of Data at LinkedIn, and more.\nWho we are:\nFreshpaint was founded by web analytics veterans who realized how hard it was for highly regulated companies to collect and use customer data in a compliant way. We started as part of Y Combinator’s S19 cohort and have been focused on enabling healthcare companies collect, safeguard, and activate patient data since.\nIn 2022 the government issued updated guidance around HIPAA, basically making our software a requirement to use for healthcare companies. As a result, we're one of the fastest growing software companies on earth right now.\nOur team has deep analytics and growth experience, with all of us coming from high-growth companies like Heap, Pendo, Iterable, Quantum Metric, and Retool. If you value lots of freedom and ownership in your work, interfacing with customers, and working on a product with high customer impact, then Freshpaint is your home.\nThis role will give you the opportunity to:\nGet hands on with many aspects of running a startup - you'll get exposure to customers, sales, product, growth, and more.\nDelight customers. You’ll be able to ship features that provide immediate benefits to our customer base.\nWhat you'll be doing:\nBuild and expand the privacy-first backbone that our healthcare customers rely on to serve their users and patients.\nDevelop the tools that our healthcare customers need to see their audiences, market to them, and optimize for them.\nPair program with engineers in an iterative environment that gives space for exploration.\nRequirements - what you'll bring:\n(If you don't meet all of these requirements, you should still apply. We're big on high-slope individuals, so if you can quickly grow into some requirements we'd love to hear from you)\nYou have at least 7 years of experience in a software engineering role\nYou learn fast and are able to get up to speed quickly on new tools and technologies\nYou get things done – fast. You take ownership and solve problems when you see them\nYou are able to understand and reason about complex systems\nYou have high empathy and a keen sense of understanding how other people think\n[Bonus] You’re familiar with our tech stack - Golang, Typescript, AWS, Postgres\n[Bonus] You’re familiar with the analytics/customer data/big data space\nInterview Process\nAt the start of the call, we will briefly go through a few standard verification steps to ensure we’re speaking to the right person. This helps protect both candidates and our team against AI misuse. If at any point we get the sense we aren’t speaking with the right candidate, we reserve the right to end the call early.\nRecruiter Screen\nHiring Manager Call\nVirtual Onsite with Technical Pairings\nCEO Interview\nOffer!\nPerks & Benefits\nWe take care of our team—here’s a peek at what you get when you join:\nCompetitive pay + generous equity (10-year exercise window)\nFully remote (U.S. only) with a $150/month coworking stipend\nHalf-day Fridays, every Friday\nUnlimited PTO—with a\nrequired\n2-week minimum\nTop-tier health, dental & vision (100% covered for you, 80% for dependents)\n2 “Treat Yourself” days a year—$100 and a day off, just because\nGenerous parental leave\nEpic offsites twice a year (past trips: Greece, Jackson Hole, Cabo, wine country + more)\nAnd more—\ncheck out our careers page\nfor the full list."
  },
  {
    "url": "https://jobs.ashbyhq.com/tenex/24592459-f487-43ed-8336-cff0b7e0c462",
    "company": "TENEX.AI",
    "job_title": "Senior Software Engineer (Remote)",
    "location": "United States",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": null,
    "date_posted": "2025-10-24",
    "description": "Company Overview\nTENEX\nis an AI-native, automation-first, built-for-scale Managed Detection and Response (MDR) provider. We are a force multiplier for defenders, helping organizations enhance their cybersecurity posture through advanced threat detection, rapid response, and continuous protection. Our team is composed of industry experts with deep experience in cybersecurity, automation, and AI-driven solutions.  We’re a fast growing startup backed by industry experts and top tier investor Andreessen Horowitz. As an early employee, you’ll play a meaningful role in defining and building our culture. Get in on the ground floor. We’re a small but well-funded team that just raised a substantial round – joining now comes with limited risk and unlimited upside. We are rapidly growing and seeking top talent to join our mission of revolutionizing the cybersecurity landscape.\nWe are seeking a\nSenior Software Engineer\nto join our core engineering team. You will take ownership of major product and infrastructure initiatives, working across the stack to build scalable, reliable, and secure systems. In this role, you’ll balance being a strong individual contributor with providing technical guidance to peers, ensuring high standards in code quality, design, and execution.\nYou’ll collaborate closely with product and design teams, making key technical decisions and helping define how our platform evolves. This is an opportunity to work on challenging engineering problems in security, AI, and distributed systems, while growing into a leadership position as the company scales.\nCulture is one of the most important things at\nTENEX.AI\n—check out our culture deck at\nculture.tenex.ai\nto experience how we champion it, valuing the unmatched collaboration and community of in-person work while offering flexibility for the best of the best.\nThis role is for the extraordinary—the pinnacle 10x of 10x legends in any role— where we make exceptions to our in-person hiring to champion full remote freedom, empowering you to conquer without boundaries while still inviting you to join our in-person energy from time to time.\nTo be direct up front - If you’re looking at this position, we strongly recommend you consider accepting one of our lucrative relocation packages to our epic hubs in Sarasota, Florida (outside Tampa), or Overland Park in the Kansas City metro—where trailblazers redefine cybersecurity with 10x impact!\nIn Florida, you can break free from overly inflated cost of living sky-high taxes (like those of you trapped in California or New York) via our incredibly aggressive relocation packages, enjoying zero state income tax, boundless personal freedom, a pro-business surge, endless sunshine, and a pro-family haven in the master-planned Lakewood Ranch with elite amenities and vibes. In KC, leverage those same powerhouse relocation perks for lower taxes, authentic Midwest values of integrity and community, and a supportive, family-oriented ecosystem for enduring wins.   See those respective listings with more details on our careers page.\nFor candidates who embody the rare \"10x of 10x\" talent, we offer the flexibility of fully remote work. If you are an exceptional, unrivaled force in this role and prefer not to relocate at this time, we encourage you to apply for this remote-first position. Please be aware that the competition for these remote roles is exceptionally fierce, and the standards for selection are significantly higher.\nJob Responsibilities:\nDesign, develop, and deploy scalable backend services and APIs.\nBuild and maintain intuitive and performant frontend applications.\nTake ownership of projects end-to-end, from architecture through deployment and monitoring.\nCollaborate with product, design, and other engineers to define and implement new features.\nWrite clean, maintainable, and testable code.\nParticipate in design reviews and code reviews, raising the bar for engineering quality.\nTroubleshoot complex issues across the stack and ensure system reliability.\nContribute to improving engineering processes, tools, and team practices.\nStay current with emerging technologies and bring new ideas to the team.\nQualifications\nRequired:\n5+ years of professional software engineering experience.\nStrong understanding of software engineering principles and best practices.\nProficiency in at least one backend language such as Go, Python, or equivalent.\nExperience with at least one modern frontend framework (React, Next.js, TypeScript, or similar).\nStrong experience with relational databases (PostgreSQL, MySQL, or equivalent).\nFamiliarity with cloud platforms such as GCP or AWS.\nProven ability to take ownership of complex projects and deliver them end-to-end.\nExcellent problem-solving, communication, and collaboration skills.\nDesired (While experience in all is not required, any of the following would be a plus):\nExperience with containerization technologies like Docker and orchestration tools like Kubernetes.\nExperience with CI/CD pipelines.\nExposure to AI/ML concepts and technologies, such as:\nPrompt Engineering\nRetrieval-Augmented Generation (RAG)\nSupervised Fine-Tuning (SFT)\nVector Databases\nExperience working in an early-stage startup environment.\nEducation & Certifications\nBachelor’s degree in Computer Science, Engineering, or a related field (or equivalent experience).\nGCP certifications such as Professional Cloud Developer or Professional Data Engineer are a plus.\nWhy Join Us?\nOpportunity to work with cutting-edge AI-driven cybersecurity technologies and Google SecOps solutions.\nCollaborate with a talented and innovative team focused on continuously improving security operations.\nCompetitive salary and benefits package.\nA culture of growth and development, with opportunities to expand your knowledge in AI, cybersecurity, and emerging technologies.\nIf you're passionate about combining cybersecurity expertise with artificial intelligence and have experience with Google SecOps and Chronicle, we encourage you to apply!"
  },
  {
    "url": "https://jobs.ashbyhq.com/catena-labs/30cd0eb7-4292-425f-acae-c201108280b0",
    "company": "Catena Labs",
    "job_title": "Senior Software Engineer",
    "location": "United States, United States",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": null,
    "date_posted": "2025-09-22",
    "description": "About Catena\nCatena Labs is building the first AI-native financial institution to provide the new financial infrastructure and services AI systems need to conduct commerce. We’re giving AI agents the tools to identify themselves and use money safely and efficiently. At the same time, we’re providing businesses with a trusted, licensed financial partner with the capability to manage risk and compliance. By building a financial institution with AI and stablecoin infrastructure, we are breaking down the legacy financial system barriers that prevent an AI-driven economy.\nBacked by leading venture investors, we’re assembling a team of engineers, designers, data scientists, and finance professionals working together to build a stronger, more resilient global economy that creates broad prosperity. We’re looking for people with the talent, curiosity, and passion to invent an entirely new category of financial services.\nThe Role\nAs a Senior Software Engineer at Catena, you will be a core contributor to the team inventing new ways for humans and AI agents to interact with financial systems. You will play a critical role in developing and iterating on our core platform, including the Agent Commerce Kit (ACK), building the applications, APIs, and SDKs that facilitate secure, reliable global commerce for a new, agent-driven economy.\nThis is an opportunity to solve novel technical challenges at the intersection of AI and finance. You will work in a highly collaborative environment, shipping code that directly impacts our product and helps define the future of how autonomous agents transact.\nWhat You'll Do\nBuild Agent Interaction Layers:\nDevelop robust applications, APIs, and SDKs that enable secure communication, collaboration, and transactions between AI agents and users.\nDevelop Core Product Experiences:\nBuild elegant and efficient systems to handle cryptographic identity management, payment workflows, and transaction processing within the ACK framework.\nEngineer Agent-Native Financial Systems:\nDesign and implement end-to-end user experiences tailored for AI agents, ensuring secure and reliable financial interactions.\nCreate Identity and Reputation Tools:\nEngineer systems that empower agents to establish digital identities, discover peers, and manage their reputations effectively.\nContribute to Scalable Infrastructure:\nBuild performant backend services and scalable APIs that ensure rapid and secure coordination among decentralized AI agents.\nWho You Are\nYou have 6+ years of full stack engineering experience, with a strong foundation in backend architecture as well as experience delivering user-facing products.\nYou have a track record of shipping complex production-quality products from initial concept to production.\nYou are committed to building performant, reliable, and secure systems with polished and intuitive user experiences.\nYou are comfortable working in ambiguous environments, capable of independently designing and implementing technical solutions from the ground up.\nYou have a genuine curiosity for emerging technologies like AI agents, stablecoins, and programmable identity, with desire and self-initiative to learn and apply them.\nYou effectively leverage AI tools in your workflow to multiply productivity and streamline development processes.\nNice to Haves\nHands-on experience building AI-driven solutions or integrating with modern AI toolkits.\nExperience in fintech, payments, or blockchain development.\nProficiency with our tech stack (e.g., TypeScript, Go, React).\nContributions to relevant open-source projects.\nJoin Us\nIf you're passionate about pushing the boundaries of what AI agents can do in financial services and want to be part of building the trusted financial infrastructure for the agentic economy, we want to hear from you. You'll have the opportunity to work on challenging problems that have never been solved before, with a team that's defining an entirely new category of financial services.\nThis is more than a job; it's a chance to be part of the startup team that makes the AI economy possible. Your work will directly enable millions of AI agents to participate safely in commerce, unlocking trillions in economic value and increasing prosperity around the world.."
  },
  {
    "url": "https://jobs.ashbyhq.com/Vetcove/9226f7c7-b8be-4956-92c4-1b93b0704334",
    "company": "Vetcove",
    "job_title": "Senior Software Engineer",
    "location": "Remote, Remote, USA",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": null,
    "date_posted": "2022-09-29",
    "description": "Join our growing team at Vetcove, and help us transform how veterinarians buy the supplies they need to keep America's pets healthy. Vetcove's eCommerce and mobile platforms enable veterinary practices to compare and buy from all of their vendors in one place. Our community of more than 17,000 veterinary hospitals employs tens of thousands of veterinarians, and delivers care to many millions of animals every year across all 50 states. We’re a growing team on a mission to modernize the $50B+ animal health industry. Simply put, Vetcove helps veterinary organizations spend more time giving care, and less time shopping and comparing across vendors to supply their practices. Vetcove is a Y Combinator and venture-backed growth stage company with notable investors in Silicon Valley and NYC. We're looking for exceptionally talented and passionate people to join our growing team.\nAbout the Position\nThe Software Engineer Role is a key member of our engineering team who is responsible for supporting projects from conception to completion. This level of involvement includes plan formulation, creation, maintenance and upgrade implementations across most of the technology stack. As a contributor to the core features of the Vetcove platform, you will be an integral part of ensuring we are creating intuitive and innovative products that our users need for success in their day to day.\nAbout our team\nWe believe every engineer at Vetcove should have a holistic view of Vetcove and work on many areas of our technology stack. We encourage you to apply to help us grow a system that facilitates billions of dollars in orders each year. We move lightning-fast in an industry that was previously slow to adopt technology. As Vetcove quickly expands its offerings to better serve veterinary groups and its supply chain partners, we’re quickly growing our engineering team to keep pace with the rapid expansion of our business, while maintaining exceptional code quality and system integrity.  You’ll have an opportunity to work closely with end users, handle large scale infrastructure challenges, and everything in between.\nSome projects we've worked on recently\nA real time analytics platform to display billions of dollars in purchase history\nA dynamic advertising platform that gives away millions of dollars in cash back rewards to clinics\nA mobile shopping experience that lets clinic shop using their phone’s camera\nLaid the foundation for a new, modern architecture to support seamless interactivity between several major features\nWhat you'll do\nContribute to the conceptualization and feature documentation of new ideas and product enhancements\nBuild and extend interactive React applications that will be used by tens of thousands of veterinary purchasers, corporate hospital groups owners, and animal health manufacturers\nAdd good test coverage\nBuilding reusable components for use by the larger team\nImplement new features into our React Native applications\nWork directly with our CTO and engineering team, as well as across other functions to continuously evolve our platform and products\nWhat you should have\n2 years of professional software engineering experience, (preferably building web applications)\nHigh proficiency over at least one industry-common language and be conversant (and interested to improve!) in others\nExperience in building a professionally successful production application in a modern web framework\nAbility to design new features around data models with accuracy, security, and performance in mind\nExperience working with a database and analyzing queries for improved optimizations\nFluency with JavaScript’s features as a prototyped and functional language\nGood software testing habits\nExcellent written and verbal communication skills\nAbility to adapt quickly and manage many concurrent responsibilities\nA strong desire to help our customers succeed\nA positive attitude and one-for-all team mentality\nExperience working with a backend language, an ORM, and writing API endpoints\nStartup work experience is a plus\nTools we use\nBackend:\nPython (Django, Django Rest Framework)\nFrontend:\nJavaScript (React, Redux), Less.js, Typescript, Webpack\nDatastores:\nPostgres, Elasticsearch, Redis\nMobile:\nReact Native\nVersion Control:\nGit\nBenefits (Full Time Roles)\n100% remote within the USA\nMedical, Dental, and Vision Insurance\nAutomatic 401k contribution\nEmployee referral program\nAt home office set up\nBi-annual company retreats\nOpen vacation policy\nEquity\nMonthly team events\nThe typical base pay range for this role across the U.S. is: $115,000/year - $200,000/year + bonus + equity + benefits.\nThere is a different range applicable to specific work locations.\nFor Colorado, the salary range is: $135,000 - $175,000 + bonus + equity + benefits. This salary range is a good faith estimate of what Vetcove may pay for this position at the time of posting. Actual compensation may vary based on skills, qualifications, and experience. The range reflects the base hourly rate or annual compensation (as applicable), and does not include bonus, equity or other incentives.\nIn addition to base compensation, Vetcove offers a comprehensive benefits\npackage. Please refer to the “Benefits (Full Time Roles)” section above for more\ndetails.\nTo apply, please submit your application through Vetcove’s Careers Page. The application deadline is accepted on an on going basis.\nPlease note we are unable to sponsor work visas at this time.\nAttention all job seekers!\nWe want to ensure that you’re well-informed about a serious matter affecting the job market. It has come to our attention that scammers are operating in the industry, impersonating employees and attempting to deceive savvy applicants like you. Here’s what you need to know:\nOur job listings are exclusively available on official sites (our careers page, LinkedIn, BuiltIn, and Indeed). Be cautious of other sources claiming to represent us or any organization that you’re interested in. Stay on the lookout!\nAuthentic communications from our company will only come through verified email addresses and phone numbers. If you receive unexpected messages or calls, exercise caution and verify their authenticity. Don’t let scammers catch you off guard!\nIt's essential to independently verify the legitimacy of any job postings you come across. Visit our official careers page to confirm the validity of any openings. Stay proactive and protect yourself!\nRemember that during the application process, we will\nnever\nrequest sensitive personal or financial information from you. Be wary of anyone asking for such information. Keep your personal data secure!\nIf you suspect any fraudulent activity or encounter suspicious individuals, please report it immediately to our recruiting department. By working together, we can combat these scams and keep the job market safer for everyone.\nWe understand the importance of your job search and want to ensure your experience is positive and secure. Always exercise caution and stay scam-smart!\nVetcove is an equal opportunity employer and is committed to creating a diverse and inclusive workplace. We welcome applicants from all backgrounds, regardless of race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity, or any other protected status. We are dedicated to providing a work environment free from discrimination, harassment, and retaliation. It is our policy to provide equal employment opportunity to all applicants in accordance with all applicable laws and regulations. If you require accommodations during the application or interview process, please let us know and we will make every effort to accommodate your needs."
  },
  {
    "url": "https://jobs.ashbyhq.com/vanta/5d1f97a8-1fb2-40ee-8f1f-6d3d1599ffc1",
    "company": "Vanta",
    "job_title": "Senior Software Engineer, Foundations",
    "location": ", , USA",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": "$207,000 - $244,000 USD",
    "date_posted": "2025-05-20",
    "description": "At Vanta, our mission is to help businesses earn and prove trust.\nWe believe that security should be monitored and verified continuously, and we empower companies to practice better security and prove it with ease. Vanta has a kind and talented team, and while some have prior security experience, many have been successful at Vanta without it.\nThe Foundations team sits at the heart of Vanta’s architecture and is critical to unlocking current and future Vanta products. We fetch, process, and serve the core resource and evidence data that powers Vanta. As a member of this team, you’ll work on the source-of-truth systems that enable core Vanta compliance and auditing experiences.\nWe’re looking for a senior backend engineer who thrives on shipping quickly, solving real customer problems, and building reliable systems that scale.\nVisit our\nVanta Engineering Blog\nto learn more about what our team is working on!\nWhat you’ll do as a Senior Software Engineer at Vanta:\nImprove the scalability and reliability of our core data systems, ensuring they’re robust in the face of growth.\nHelp define and evolve how we model, store, and query resource data across Vanta.\nCollaborate with product, design, and other engineering teams to understand user needs and prioritize impactful work.\nShip quickly and experiment thoughtfully to validate ideas and drive product velocity.\nAct as a cultural beacon, setting an example for effective, collaborative engineering and helping mentor junior team members\nMake effective tradeoffs that consider business priorities, user experience, and a sustainable technical foundation\nDrive initiatives to increase operational posture and execution quality across the engineering organization\nHow to be successful in this role:\nHave 5+ years of experience\nBe comfortable operating robust distributed systems and navigating scaling challenges. Have familiarity with event-driven architecture.\nCare deeply about understanding and solving customer problems.\nWork well in environments that value decisive action and getting things done, and bias towards shipping quickly to validate ideas and experiment rather than building a perfect solution.\nHave led meaningful technical projects from concept to completion\nWhat you can expect as a Vantan:\nIndustry-competitive compensation\n100% covered medical, dental, and vision benefits with dependents coverage\n16 weeks fully-paid parental Leave for all new parents\nHealth & wellness and remote workplace stipends\nFamily planning benefits through Carrot Fertility\n401(k) matching\nFlexible work hours and location\nOpen PTO policy\n11 paid holidays in the US\nOffices in SF, NYC, London, Dublin, and Sydney\nTo provide greater transparency to candidates, we share base pay ranges for all US-based job postings regardless of state. We set standard base pay ranges for all roles based on function, level, and country location, benchmarked against similar-stage growth companies. Final offer amounts are determined by multiple factors and may vary based on candidate location, skills, depth of work experience, and relevant licenses/credentials.\n#LI-remote\nAt Vanta, we are committed to hiring diverse talent of different backgrounds and as such, it is important to us to provide an inclusive work environment for all. We do not discriminate on the basis of race, gender identity, age, religion, sexual orientation, veteran or disability status, or any other protected class. As an equal opportunity employer, we encourage and welcome people of all backgrounds to apply.\nAbout Vanta\nWe started in 2018, in the wake of several high-profile data breaches. Online security was only becoming more important, but we knew firsthand how hard it could be for fast-growing companies to invest the time and manpower it takes to build a solid security foundation. Vanta was inspired by a vision to restore trust in internet businesses by enabling companies to improve and prove their security. From our early days automating security monitoring for compliance standards like SOC 2, HIPAA and ISO 27001 to creating the world's leading Trust Management Platform, our vision remains unchanged.\nNow more than ever, making security continuous—not just a point-in-time check— is essential. Thousands of companies rely on Vanta to build, maintain and demonstrate their trust— all in a way that's real-time and transparent."
  },
  {
    "url": "https://jobs.ashbyhq.com/quora/0a9ab068-a5c4-409b-b6be-ad2f7eecd88e",
    "company": "Quora",
    "job_title": "Senior Software Engineer - Data Infrastructure, Quora (Remote)",
    "location": "United States",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": null,
    "date_posted": "2025-10-22",
    "description": "[\nQuora is a privately held, \"remote-first\" company\n.\nThis position can be performed remotely from multiple countries around the world. Please visit\ncareers.quora.com/eligible-countries\nfor details regarding employment eligibility by country.]\nAbout Quora:\nQuora’s mission is to grow and share the world’s knowledge. To do so, we have two knowledge sharing products:\nQuora\n: a global knowledge sharing platform with over 400M monthly unique visitors, bringing people together to share insights on various topics and providing a unique platform to learn and connect with others.\nPoe\n: a platform providing millions of global users with one place to chat, explore and build with a wide variety of AI language models (bots), including GPT-5, Claude Sonnet 4.5, Grok 4, Veo 3, Gemini 2.5 Flash Image (Nano Banana), and more. As AI capabilities rapidly advance, Poe provides a single platform to instantly integrate and utilize these new models.\nBehind these products are passionate, collaborative, and high-performing global teams. We have a culture rooted in transparency, idea-sharing, and experimentation that allows us to celebrate success and grow together through meaningful work. Join us on this journey to create a positive impact and make a significant change in the world.\nThis role will be working on our Quora product.\nAbout the Team and Role:\nOur data infrastructure team is responsible for all things data - data lake, data pipelines, distributed query engines, experimentation framework, data dashboards and visualization tools and so on. Our data-ecosystems is composed of open source technologies like Kafka, Hive, Trino, Spark and Airflow, along with a few in-house-built systems. As a member of our team you would spend time designing and scaling our existing infrastructure, improving system’s reliability, working closely with other teams to improve or create new tooling for our infrastructure, and promoting the correct use of data at the company. We are looking for someone who will be excited by the prospect of optimizing, enhancing or even re-designing our company’s data architecture/pipelines to support our next generation data initiatives.\n🌟 Discover Our Team's Exciting Projects! 🌟\nJoin us on a journey through some of our standout achievements that showcase innovation and collaboration at Quora:\n🚀\nMigrating a Decade of Redshift Usages to Trino at Quora\n: Dive into how we transformed our data ecosystem, enhancing efficiency and performance!\n⚡\nRevamping the Spark Ecosystem at Quora\n: Explore our efforts to elevate Spark, making it more powerful and user-friendly for our engineering teams!\n🎥\nAdopting Trino's Fault-tolerant Execution Mode at Trino Summit 2023\n: Catch the highlights from our presentation at the Trino Summit, where we shared insights on building resilience in data processing!\nGet inspired by the impact we're making, and imagine the possibilities for your own journey with us!\nResponsibilities:\nDesign and implement scalable and efficient data architectures, meeting data needs from data scientists, engineers and business partners\nIdentify and implement improvements to system’s cost efficiency, reducing data storage and processing costs\nBring your expertise to help model structured & unstructured data. Own these data models at a high level & be a data consultant for partner teams\nChampion best practices on system usages and hold high-quality code standards\nParticipate in the team’s oncall rotation, helping solve timely reliability incidents\nMinimum Requirements:\nAvailability for meetings and impromptu communication during Quora's “\ncoordination hours\n\" (Mon-Fri: 9am-3pm Pacific Time)\nMust have 4+ years of experience working in Data Infrastructure\nFlexibility for working and owning different Data Engineering systems. Open to working on the areas with highest priority for the company at a given time\nOperational mindset with ability to do Problem diagnosis, Root cause analysis, Performance tuning and Incident Management\nProficiency in Python and SQL query design\nProficiency with big data processing frameworks, like: Hive, Spark and Trino\nExperience building data-intensive applications (high velocity/high volume)\nExperience with SQL/NoSQL data store & data lake operations\nPreferred Requirements:\nHands-on experience with AWS technologies like S3, EC2, RDS, EKS, or in Apache Iceberg\nFlexible and positive team player with good interpersonal skills\nAt Quora, we value diversity and inclusivity and welcome individuals from all backgrounds, including marginalized or underrepresented groups in tech, to apply for our job openings. We encourage all candidates who share a passion for growing the world’s knowledge, even those who may not strictly meet all the preferred requirements, to apply, as we know that a diverse range of perspectives can have a significant impact on our products and our culture.\nAdditional Information:\nWe are accepting applications on an ongoing basis. This role is a backfill for an existing vacancy.\nQuora offers a wide range of benefits including medical/dental/vision coverage, equity refreshers, remote work reimbursement, paid time off, employee assistance programs, and more. Benefits are country-specific and may vary. For more information on benefits, visit this link:\nhttps://www.careers.quora.com/benefits\nThere are many factors that will determine the starting pay, including but not limited to experience, location, education, and business needs.\nUS candidates only: For US based applicants, the salary range is $155,656 - $225,160 USD + equity + benefits.\nCanada candidates only: For Toronto and Vancouver based applicants, the salary range is $201,613 - $233,311 CAD + equity + benefits. For all other locations in Canada, the salary range is $188,172 - $217,757 CAD + equity + benefits.\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\nPlease note: AI technology may assist in sorting applications and recording interview notes, but all decisions are made by a member of our team.\n#LI-SK1\n#LI-REMOTE"
  },
  {
    "url": "https://jobs.ashbyhq.com/schoolhouse-world/4a6b99f6-9f70-4f1f-8704-bf2f3d41fd8e",
    "company": "Schoolhouse",
    "job_title": "Senior Software Engineer",
    "location": "United States",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": "$176,000 - $200,000 USD",
    "date_posted": "2025-10-17",
    "description": "About Schoolhouse\nFounded by Sal Khan,\nSchoolhouse\nis the world’s largest free, peer tutoring platform that brings genuine human connection to online learning in a world that’s being rapidly disrupted by AI. So far, we’ve reached 150k+ learners from 180+ countries and we plan to grow to millions.\nAt Schoolhouse, learning isn’t just academic – it’s civic, human, and global. Students join tutoring sessions where peers help them reach academic goals through personalized support. They participate in Dialogues to discuss challenging issues and empathize across divides. Above all, students belong to a global community centered around human connection.\nAbout the Vision\nOur vision is to provide a global safety net so that every student can thrive in an AI era. To us, this means creating an learning environment where anyone, anywhere can access not just knowledge, but also mentorship, community, and credentials that unlock opportunity. By meaningfully bringing students together at scale, we ensure no talent goes undiscovered and truly connect the world through learning.\nWe believe this vision is ambitious, so we need a team that can move quickly in the face of ambiguity. We value sincerity and empathy and believe in the power of human connection. We step in to help each other out, we think big but start small, we uplift each other, and we’re all learners at heart.\nLearn more about our vision and our values here:\nTeen Helps 52-Year-Old Man Earn His High School Diploma\nThe Power of Peer Tutoring\nSchoolhouse’s Public Roadmap\nWhat are Schoolhouse's community values?\nAbout the Role\nWe’re looking for a\nSenior Software Engineer\nwho wants to build something that’ll have an impact. You’ll join our 5-person engineering team and own full-stack features that hundreds of thousands of learners and tutors use worldwide.\nEngineers at Schoolhouse have lots of ownership — you’ll work directly with our designer and other stakeholders to build out new experiments and streamline existing operations. We think the best way for engineers to build a quality product is to be involved early, drive progress, and stay close to our end users.\nScaling free quality interactions between students around the world comes with challenges that live at the intersection of UX, people ops, and technology. We need to both meet learner / tutor needs while ensuring that these interactions stay high quality and safe.\nSome examples of what we’ve worked on include:\nBuilding an AI simulation & coach to help tutors practice for their first tutoring session\nExperimenting with new ways to connect tutors to learners wanting immediate homework help\nCreating a moderation system to automatically recognize and act on safety issues so humans can focus their time on the most important issues\nResponsibilities:\nOwn technical decisions & implementation from ideation to launch alongside other stakeholders\nWrite simple, readable code & abstractions that future engineers can easily maintain & change\nRaise our code quality standards through code reviews and mentoring other engineers\nAbout You\nIf this sounds like you, we’d love for you to apply!\nYou’ve been a full-stack software engineer 3+ years and feel comfortable creating new user experiences, building solid abstractions & spinning up infrastructure.\nYou have a track record of designing and building systems and can talk through tradeoffs between stability, scalability, and maintainability.\nYou have experience with Typescript, Node.js, React, Next.js, and Postgres (or can ramp up quickly).\nYou love writing robust, maintainable code. Few things feel as good as solving a complex problem with a simple, understandable solution.\nYou notice when abstractions or processes could be better and find a way to improve them.\nYou build for users & have a nose for understanding what would help them the most.\nYou move quickly while maintaining quality and want to ship regularly. Perfect is the enemy of good.\nYou fill in the gaps — you ask for help, but still work independently to figure things out. If necessary you can put on another hat if it’ll help users the most.\nYou’re excited about mentoring and helping other engineers grow, but are also eager to learn from and alongside them too.\nYou’re available to work in a US timezone.\nBonus points\nYou have deep technical experience with our stack Typescript, Node.js, React, Next.js, Postgres, AWS, and GCP.\nYou have experience building mobile apps.\nYou have experience working in education or on an ed-tech product.\nLife at Schoolhouse\nWork with an amazing team.\nWe’ve got folks with backgrounds in education, consulting, astrophysics, startups, and more.\nFully remote\nwith\nflexible working hours.\nMeetings are in US Pacific Time.\nTake real time off.\nWe have unlimited PTO & use it. Folks regularly take time off throughout the year.\nCompetitive salary\nand\ncomprehensive benefits.\nWork-from-home stipend. Professional development budget. Health, dental, vision (for US employees).\nSemesterly retreats\nand\nmonthly regional meetups\nMake an impact you can see.\nCheck out our\ncommunity stories page\n. Watch students help each other learn. See tutors grow into leaders. Your code will help real people learn and grow.\nAbout the Application Process\nApply by 11:59 PM ET on November 7th, 2025\nWe might make some adjustments, but our previous interview processes have consisted of:\nA 30-minute intro call, to learn more about you, and understand whether this role is a mutual fit.\nA 2-hour compensated take-home project, where you’ll implement a feature in a web application that mirrors our stack.\nA 1-hour live interview where we’ll pair program on fixing bugs and implementing features on a toy repo.\nA 1-hour live interview to work through a systems design problem together.\nReference calls.\nIf needed, one additional 45-minute call to talk through any remaining questions.\nWe are committed to building an inclusive and equitable platform for learners across the world, and it’s important our core team reflects these principles too. We strongly encourage people from underrepresented groups to apply."
  },
  {
    "url": "https://jobs.ashbyhq.com/Iodine%20Software/2b0fddd6-5902-4ac2-bb4f-55e2c4ba4984",
    "company": "Iodine Software",
    "job_title": "Senior Software Engineer - Full Stack",
    "location": "United States",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": "$135,000 - $175,000 USD",
    "date_posted": "2025-06-03",
    "description": "Join us. Let’s make a direct impact in healthcare.\nBeing an Iodine employee means becoming part of something bigger - using clinical AI technology to drive smarter healthcare processes and positively impact patient care.\nWho we are:\nRecognized as one of Austin’s best places to work, we are a collaborative and dedicated team with innovation built into our DNA. Iodine is an enterprise AI company that is championing a radical rethink of how to create value for healthcare professionals, leaders, and their organizations - by automating complex clinical tasks, generating insights and empowering intelligent care. Powered by one of the largest sets of clinical data and use cases available, our groundbreaking clinical machine-learning engine, Cognitive ML, constantly ingests the patient record to generate real-time, highly focused, predictive insights that clinicians and hospital administrators can leverage to dramatically augment the management of care delivery.\nWhat we’re looking for:\nOur client base is constantly growing and we’re looking for great Software Engineers to make our team better. Our Software Engineers  have an opportunity to work on our Clinical Documentation Integrity, Utilization Management, and Audit platforms. You’ll be challenged often and will find yourself working on all areas of the application domain across the full app delivery stack.\nWhile this is a hands-on role where coding is a large part of the job, equally important is the ability to lead a team to convert product vision to software design/implementation. We embrace the “you run what you write” principle so you’ll also have a chance to operate our production infrastructure. Finally, this is an opportunity to work with a group of other passionate software professionals in an engineering-led culture to make healthcare better.\nDesign and implement highly resilient, scalable, and performant solutions that solve complex healthcare problems using our advanced tech stack\nParticipate in technical and product discussions with leaders across our engineering, product, and business teams\nSelf-reliance, without supervision, while showcasing best design/communication/solution practices in daily works and tasks\nEnsure continuously improve our standard of engineering excellence\nWhat You’ll Need\nMinimum Requirements:\nBS in Computer Science/related area or equivalent work experience\nStrong experience with Node.js\n7+ years of experience building modern web applications\n3+ years current experience with modern web development and web UI\nStrong proficiency in SQL, CI/CD and Automated Testing\nExcellent written and verbal communication\nStrong programming skills in at least two of Java, Typescript/Javascript, and Python languages\nExperience working with frontend Javascript frameworks (VueJs, React, Angular)\nTravel to and from company headquarters is required for mandatory onboarding and company meetings.\nPreferred Requirements:\nJava/Spring and Node web applications\nPostgreSQL\nMicroservices and Distributed application architectures\nBatch and Streaming Data processing using Kafka or similar data pipeline technologies\nAI, Machine Learning and predictive algorithms\nDocker/Kubernetes\nFamiliarity with Healthcare domain including HL7, Claims/Payments data models\nPlease note this position is not restricted solely to the responsibilities listed above and that the job scope and responsibilities are subject to change.\nWhat we offer:\nComprehensive Healthcare:\nFully covered medical, vision, and dental benefits for employees, plus generous dependent coverage.\nTelehealth Services\n: Convenient access to telehealth services tailored for remote work.\nSavings Accounts:\nTax-advantaged savings accounts for healthcare and dependent care expenses.\nAncillary Benefits:\nLife, AD&D, and disability insurance paid by Iodine for peace of mind.\nRetirement Plan\n: Competitive 401(k) retirement plan with a considerable company match.\nExtra Life Insurance:\nOptional additional life insurance coverage for you and your dependents.\nAccident Insurance\n: Financial protection against unexpected accidents and critical health issues.\nCritical Illness Insurance:\nProvides financial support for medical costs and living expenses during serious illness.\nHospital Indemnity Insurance:\nAdditional support for hospital-related expenses through indemnity insurance.\nPet Insurance:\nAffordable options for discounted pet insurance.\nLegal and Identity Protection\n: Legal and ID theft protection to safeguard personal information.\nEmployee Assistance:\nConfidential employee assistance program for personal and professional challenges.\nEducation Allowance:\nAnnual funding for educational pursuits and continuing education to support professional development and skill enhancement.\nReimbursements\n: Annual reimbursement for eligible wellness expenses, monthly reimbursement for cell phone and WiFi costs, and a one-time equipment allowance for creating a comfortable home office.\nWhy should you join Iodine?\nThis is a unique opportunity to join a close-knit, rapidly growing team and help us improve a key piece of the organization. You will have the opportunity to drive smarter healthcare processes through technology, so hospitals can stay focused on patient care. You will join a passionate and ambitious team, with a proven record of success building multiple companies. Learn more about our company culture on\nBuilt In Austin\nand on our website at\nwww.iodinesoftware.com\n."
  },
  {
    "url": "https://jobs.ashbyhq.com/amper/13897e47-8040-41ea-9038-2f89102bd618",
    "company": "Amper",
    "job_title": "Senior Software Engineer",
    "location": "Chicago, Illinois, United States",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": null,
    "date_posted": "2025-08-13",
    "description": "Amper is an early-stage, VC‑backed SaaS technology company on a mission to modernize manufacturing from the ground up. Our platform is designed to transform legacy shop‑floor complexity into actionable intelligence that empowers teams across the plant to run operations on reality, and help manufacturers reduce costs, increase visibility, and drive efficiency.\nGiven the highly collaborative nature of this team, we support remote work but have a strong preference for candidates located in the Chicagoland area who are open to coming into the office for in-person collaboration. We have no set requirement for if or how often team members come in, but being local allows for flexibility to connect in person when it’s most valuable.\nThe role...\nWe’re growing our engineering team and we’re looking for a\nSenior Full Stack Engineer\nto continue building our customer-facing and internal products.\nWorking as a full-stack engineer at Amper means working in a wide variety of contexts. We build large APIs as well as microservices. We write a lot of Python. Our front ends are largely React alongside some third party tools. We need to build for the web and for mobile. Sometimes we’re working through the challenges of distributed systems, sometimes we’re tuning a single database query because we need that extra bit of performance.\nBeing a\nSenior Software Engineer\nat Amper also means being a “product person.” Our engineers don’t just move tickets from pile A to pile B. Led by a Product Owner, you'll help us work through new ideas and figure out the best way to implement them.\nYou’ll enjoy working at Amper if you:\nHave a strong appetite for the unfamiliar; that includes technical content as well as solving problems our customers face\nBelieve that being helpful and humble are just as important as technical know-how\nCan teach the things you know well, and acknowledge what you can learn from others\nFor our senior-level SWE role, we're looking for:\nAt least 7 years of professional experience\nbuilding and maintaining complex software systems, with significant time spent on a B2B SaaS platform product. This is a must-have for success in the role.\nDeep technical expertise\nin developing both large APIs and smaller microservices, with a proven ability to evaluate architectural trade-offs and guide others through implementation.\nAdvanced proficiency in Python\n(or another modern object-oriented language) with the ability to produce clean, maintainable, and testable code.\nExtensive experience with relational databases\n, including performance tuning, query optimization, and applying strategies like sharding or schema redesign when appropriate.\nStrong working knowledge of distributed systems\n, including containerization, message queues, and parallel processing, along with the ability to apply these concepts in production environments.\nFull-stack development experience\n, with deeper expertise and enjoyment working on the back end while remaining comfortable contributing to front-end development (React) when needed.\nExperience delivering solutions across platforms\n, including web and mobile, with an emphasis on performance, scalability, and reliability.\nA product-oriented approach\nwith a history of collaborating closely with Product Owners to define, design, and deliver customer-focused solutions.\nExcellent written and verbal communication skills\nand a collaborative mindset for working across engineering and non-engineering teams.\nA track record of thriving in fast-paced environments\n, ideally within early-stage, high-growth companies or similarly dynamic settings.\nA commitment to continuous learning and knowledge sharing\n, both mentoring others and seeking out opportunities to grow your own skills.\nPreferences\nKnowledge of DevOps tooling and practices (CI/CD, Monitoring)\nExperience deploying infrastructure (Infrastructure-as-code, cloudformation, ansible)\nOur Candidate Selection Process\nWe aim to keep our hiring process quick, transparent, and mutually beneficial — giving both you and our team the opportunity to learn enough about each other to make a confident decision. Our process typically includes:\nResume Review –\nWe assess your experience and qualifications against the role.\nRecruiter Screening Call –\nA brief conversation to learn more about your background, career goals, and what you’re looking for in your next role.\nTechnical Screening Call (45 minutes) –\nConversation with a Senior Engineer to assess your technical experience and capabilities.\nTechnical Paired Interview –\n90-minute collaborative coding exercise in a repo to understand problem-solving, teamwork, and technical skills.\nFinal Interview with Hiring Manager –\nA deeper discussion about your experience, the role, and how we might work together.\nReferences –\nWe connect with a few people who have worked closely with you to learn more about your strengths and working style.\nOffer –\nIf it’s a great fit on both sides, we’ll extend an offer and look forward to welcoming you to the team.\nCompensation & Benefits:\nThe range of annual base salary for full-time employees for this position is $160,000-180,000 per year, plus early-stage stock option equity. Please note that base pay offered will vary depending on factors including your city of residence, job-related knowledge, skills, and experience. Amper provides a comprehensive benefits package, including medical, dental, and vision insurance, 401(k), and unlimited paid time off."
  },
  {
    "url": "https://jobs.ashbyhq.com/onebrief/7d6a2098-0889-487a-9ced-280b359ae376",
    "company": "Onebrief",
    "job_title": "Senior Software Engineer, Full-stack",
    "location": ", , USA",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": "$180,000 - $230,000 USD",
    "date_posted": "2025-09-19",
    "description": "About Onebrief\nOnebrief is collaboration and AI-powered workflow software designed specifically for military staffs. By transforming this work, Onebrief makes the staff as a whole superhuman - meaning faster, smarter, and more efficient.\nWe take ownership, seek excellence, and play to win with the seriousness and camaraderie of an Olympic team. Onebrief operates as an all-remote company, though many of our employees work alongside our customers at military commands around the world.\nFounded in 2019 by a group of experienced planners, today, Onebrief’s team spans veterans from all forces and global organizations, and technologists from leading-edge software companies. We’ve raised $123m+ from top-tier investors, including Battery Ventures, General Catalyst, Insight Partners, and Human Capital, and today, Onebrief is valued at $1.1B. With this continued growth, Onebrief is able to make an impact where it matters most.\nAbout the role\nAs a\nSenior Software Engineer,\nyou'll work in close collaboration with our product, design, and tech operations teams. You'll be responsible for implementing and refining our realtime collaboration, maps, data visualization, rich text, and presentation features, as well as workflows and integrations—all of which are distinguished by rich and highly interactive user interfaces. This is a hands-on role, but you'll also play a key function in continuously improving our end-to-end architecture and developer experience.\nWhat you'll do\nOwn team-level architecture,\ndelivering strategic and tactical software to address defined problems\nBegin to influence\nwork outside of your direct team, solving complex problems impacting performance, features, and product design\nSupport and unblock peers\nthrough async reviews, pairing, and mentorship\nWork in an async-first way\n, aligning clearly on scope, tradeoffs, and outcomes\nBuild across the stack\n, using TypeScript/React/Node with PostgreSQL, Redis, and Kubernetes under the hood\nWhat we look for\n3-5 years of experience as a Software Engineer, including owning meaningful product or platform surfaces\nExperience collaborating across teams to deliver elegant, strategic solutions to defined problems\nA comprehensive understanding of the current state of web technology and best practices\nA track record of shipping in B2B SaaS or similarly demanding domains\nClear, context-rich communication across PRs, RFCs, and collaborative docs\nComfort navigating ambiguity and low-process, async environments\nHands-on experience improving team velocity via tooling or process improvements\nCore tech we use\nFrontend\n: React, TypeScript, Vite, shared component libraries, client-side observability\nBackend\n: Node.js, PostgreSQL, Redis, secure RESTful APIs\nInfrastructure\n: Kubernetes, AWS, CI/CD pipelines\nIntegrations\n: CSV/Excel/KML importers, JWT auth, PDF exports, DoD data systems"
  },
  {
    "url": "https://jobs.ashbyhq.com/phantom/01acfd54-49c2-4913-a968-fc70fcf61e12",
    "company": "Phantom",
    "job_title": "Senior Software Engineer, Backend",
    "location": null,
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": null,
    "date_posted": "2025-10-30",
    "description": "Phantom is revolutionizing the way millions of people interact with the crypto ecosystem. Our self-custodial wallet offers a seamless, unified experience for managing accounts and tokens across Solana, Bitcoin, Ethereum, and Polygon, empowering users with a single, convenient solution. By integrating cutting-edge security features and launching innovative tools for an enhanced personalized user experience, Phantom is able to provide a next-generation, safe and easy to use self-custodial wallet for everyone. This strategy has allowed Phantom to achieve significant milestones including surpassing 7 million MAU’s, reaching #1 in the Google play store finance category, and consistently trending as a Top 50 app across all categories, right next to X, PayPal, Coinbase, and ChatGPT.\nResponsibilities\nStaff Backend Engineer who blends systems thinking with product pragmatism and a real passion for crypto. You’ll design, maintain, and evolve the backend services and APIs that connect Phantom Cash to blockchains. You understand both client-server architecture and blockchain protocols, and you know how to balance reliability, quality, and speed. You communicate clearly across pods, document rigorously, and elevate the engineering bar through execution and mentorship. Your work will make Phantom Cash feel dependable, seamless, and ready to scale.\nQualifications\nBachelors degree in Computer Science or related technical field or equivalent practical experience\nPragmatic engineering mindset — focuses on results and user impact, not abstract purity.\nProactive and outcome-oriented: anticipates problems, pushes features to completion without waiting for perfect specs.\nStrong communicator and pragmatic problem solver - explains complexity simply, favors progress over perfection.\nNode.js / NestJS at scale; event-driven design (queues, retries, idempotency).\nREST API architecture: versioning, pagination, error models, authentication, rate-limiting.\nFull-stack awareness: understands trade-offs of state management (client vs server) and latency budgets.\nDistributed-systems fundamentals: concurrency, ordering, retries, data consistency.\nNice to Have\nKubernetes + AWS ops; CI/CD; observability; on-call ownership.\nDeep interest in crypto - keeps up with ecosystem changes, wallets, protocols, and security norms.\nPrevious hands-on experience in crypto or fintech (exchanges, wallets, payment rails, ledgers).\nSmart-contract and protocol understanding: knows how on-chain programs interact with off-chain services.\nBlockchain integration experience — Solana preferred, EVM acceptable.\nHas shipped high-quality products in mature, high-bar engineering organizations.\nWhy Work with Us\nOpportunity\nWe are a team of experienced builders in the blockchain and crypto industry. Our journey began from users seeking an easy, seamless path to accessing the crypto ecosystem. This passion fueled our exponential growth, allowing us to onboard over 7M+ active users in just over three years; with our user base growing weekly. Our dedication to a secure and seamless user experience has made us the leading wallet on Solana as well as our multi-chain approach enhances our platform's versatility, meeting the needs of a diverse and growing user base. By staying at the forefront of technology and user expectations, we continue to innovate and set industry standards on self-custodial crypto wallets.\nThere has never been a better time to work in crypto to help shape the future of innovation with a focus around the wallet experience!\nFirst impressions matter:\nWallets are responsible for a users first impression with crypto and onboarding new users into crypto. By ensuring that a user has a great first-time experience with crypto, we can help supercharge the growth of the entire ecosystem.\nMake crypto easier to navigate:\nThere is no easy way for a user to discover and navigate all that crypto has to offer. Wallets have a unique opportunity to help users not only onboard to crypto but also stay retained by exploring new things to do.\nWe live in a multi-chain world:\nWe currently support Solana, Ethereum, Polygon and Bitcoin with more networks to come in the new future. We are focused on creating a unified, multi-chain crypto experience for users.\nBenefits\nCompetitive salary and equity\nComprehensive insurance (medical/dental/vision) — 100% covered\nStipend for your ideal remote set-up\nFlexible hours and a supportive remote environment\nUnlimited vacation: Take time when you need it (and we really mean it!)\n401(k) retirement plan\nMonthly wellness benefit\nWeekly meal benefit\nGlobal off-sites\nWe strongly encourage candidates of all different backgrounds to apply.\nWe believe that our work is stronger with a variety of perspectives, and we’re eager to further diversify our company. If you have a background that you feel would make an impact at Phantom, please consider applying. We’re committed to building an inclusive, supportive place for you to do the best work of your career.\n#LI-DNP"
  },
  {
    "url": "https://jobs.ashbyhq.com/eigen-labs/a0ffbe6f-ede6-436e-b15c-3799fd59ee85",
    "company": "Eigen Labs",
    "job_title": "Senior Software Engineer, Backend (Research and Development)",
    "location": null,
    "job_type": "Onsite",
    "employment_type": "Full-time",
    "salary": null,
    "date_posted": "2025-10-08",
    "description": "Eigen Labs is building the infrastructure for a more trustworthy internet.\nToday's digital world runs on trust-me promises: \"Trust that this AI model is giving you unbiased results.\" \"Trust that this platform isn't manipulating your feed.\" \"Trust that this service will honor its commitments.\" These trust assumptions create massive friction and limit what's possible online.\nEigenCloud changes this by making any digital service verifiable. Built on our EigenLayer protocol, which has attracted billions in economic security, EigenCloud lets developers build applications with mathematical trust guarantees instead of pinky promises.\nFor developers, this means the best of both worlds: Use familiar cloud tools and programming environments while gaining blockchain-level verifiability. No need to rewrite your application in specialized blockchain languages or accept the limitations of smart contract environments.\nFor the world, this unlocks transformative applications:\nAI systems with economic accountability for their outputs\nSocial platforms with verifiable, manipulation-resistant algorithms\nPrediction markets that can resolve on any real-world event\nFinancial services with cryptographic transparency\nAny application where trust and correctness matter\nWe're moving beyond crypto's current focus on digital money to make all digital interactions more trustworthy. With the fastest-growing developer ecosystem in crypto and backing from top-tier investors, we're at the inflection point where verifiable computing goes mainstream.\nReady to build the trust layer for the internet? We're looking for builders who want to solve hard problems and create technology that makes the digital world fundamentally more reliable.\nThe Role\nThe Research and Development (RnD) team works on cutting edge problems related to verifiable computing. Being a part of this team you will get to do both research and development of the product from MVP to launching it to customers. Our current work derives from confidential computing space and how to make it available to users using blockchain technologies. Our team is small and we expect everyone to be super high agency\nYou will work closely with product managers, engineers and our outside partners to solve some of the most complex and challenging problems in this space.\nYou will lead research in confidential computing technologies (such as Intel TDX) to develop a deep, end-to-end understanding of their architecture, capabilities, and limitations. You will also be responsible for designing and implementing robust, production-grade systems that leverage these technologies.\nThis is a full-time hybrid position based in Seattle, with remote flexibility for exceptionally strong candidates.\nWhat You Will Do\nDesign and build production-grade systems that bring blockchain-level verifiability to offchain computation, bridging the gap between secure hardware and decentralized trust.\nArchitect, implement, and scale secure, high-performance infrastructure that pushes the boundaries of what’s possible in verifiable compute—from prototype to full production deployment.\nLead research in Trusted Execution Environments (TEEs)—such as Intel TDX—to explore how they can power the next generation of verifiable and trust-minimized offchain systems.\nWhat You Will Bring\nStrong computer science fundamentals with experience designing scalable, reliable, and secure distributed systems.\nA passion for tackling ambiguous, complex problems and driving clarity through experimentation, creativity, and technical excellence.\nYou’re highly proficient in Rust and Go.\nUnderstanding of Trusted Execution Environments (TEEs) such as Intel TDX/SGX including its internal architectures, security models, and limitations.\nNice to Have\nFamiliarity with state-of-the-art blockchain systems and the evolving landscape of verifiable compute.\nHands-on experience working with Intel TDX, especially in GPU-accelerated environments.\nPractical experience deploying or managing cloud-based TEE systems (e.g., Intel TDX on GCP, or similar platforms).\nThe target salary range for this role is $190,000 - $220,000 USD. The listed range reflects compensation for candidates located in U.S. Tier 1 markets and may vary depending on your location. In addition to base salary, total compensation may include short- and long-term incentives as well as program-specific awards.\nEigen Labs also offers a comprehensive benefits package, which includes:\nUS Benefits\nCompetitive salary and non-cash compensation (tokens and equity)\nWorld class benefits package (medical/dental/vision)\nRemote work set up stipend\nFlexible hours and a supportive remote environment\nFlexible time off\n401(k) retirement plan + company match\nMonthly wellness benefit\nYearly off-sites\nPaid parental leave\nIf hired outside of the US through an EOR, benefits will be offered based on specific country requirements and EOR offerings\nEqual Opportunity Employment\nThere's one more, very important thing. We are an equal opportunity employer. We search for amazing people of diverse backgrounds, experiences, abilities, and perspectives. We take care of each other to create an inclusive work environment where we love to come to work every day. We hope you can join us.\nWith EigenLayer, building blockchain infrastructure modules (AVSs) in a permissionless manner is no longer a hypothetical—it's our reality. Now, we invite you to be part of this exciting journey."
  },
  {
    "url": "https://jobs.ashbyhq.com/counsel/5ea59739-eb7b-4361-b62f-20343169af05",
    "company": "Counsel Health",
    "job_title": "Senior Software Engineer (Infra / Platform)",
    "location": "United States",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": "$160,000 - $225,000 USD",
    "date_posted": "2025-08-30",
    "description": "About\nCounsel\nCounsel’s mission is to multiply the world's healthcare capacity.\nWe believe in a future in which every person has a personalized, AI-enabled doctor always in their pocket. To accomplish this, we’re building the first fully-vertical, AI-native medical group from the ground up. We’ve redesigned the entire clinical stack with custom AI tools that make our in-house physicians 10x faster and smarter. [\nmore info\n]\nSince our founding in 2023, we have formed partnerships with leading healthcare organizations and are on track to serve hundreds of thousands of patients on our platform within the next year. We have raised\nover $35M\nfrom a16z and other top-tier VC firms, and on pace to 5x revenue this year.\nOur founding team includes experienced clinical and technology leaders from Harvard Medical School, Massachusetts General Hospital, UCSF, the MIT Media Lab, and Mount Sinai. Our small but stellar engineering team (ex-Stripe, NVIDIA, Google DeepMind) is growing fast — and we’re looking for exceptional people to join us at this inflection point.\nJoin us as we build the future of AI in healthcare!\nAbout the role\nWe are seeking a talented, driven, and experienced\nSenior Infrastructure Engineer\nto join us in defining the future of AI + human healthcare. This role is fully remote.\nYou will have significant responsibility and ownership over our infrastructure, along with the opportunity to shape the future of our engineering/infra organization. This role is central to ensuring our platform can scale seamlessly—meeting the demands of large healthcare clients while reliably serving hundreds of thousands of patients. Our culture is fast-paced and ambitious, and we aim for every team member to be exceptional.\nWhat you’ll be working on\nScale our infrastructure and deployments,\nmeet the demands of hundreds of thousands patients maintaining fast response time and 99.99% uptime.\nPlan and lead key infrastructure investments,\nensuring we can scale while balancing short-term delivery with long-term maintainability\nDrive development of core data infrastructure\n, including our data transformation and warehouse systems, integrations with health information networks, and data ingestion pipelines with enterprise clients\nImprove developer experience and engineering velocity\n, building the tooling, CI/CD pipelines, and observability systems that let teams move faster with confidence\nChampion operational and security excellence\n, including reliability, monitoring, on-call practices, and infrastructure security aligned with healthcare standards (HIPAA, SOC2)\nExamples of project you may work on\nOptimize our Kubernetes clusters and services to meet the demands of our scaling services\nPlan and lead a migration of our critical queue workflows in SQS onto Temporal\nRe-imagining our release operations workflows to streamline QA tested changes directly into production\nDesign and lead our multi-tenant isolation and row-level encryption strategy for sensitive enterprise client data\nRequirements\n5+ years building production software, with 2+ years deploying production systems in a cloud environment.\nProven experience building infrastructure that handles millions of requests with strict uptime and latency requirements\nProficiency with Terraform or similar tools for automated infrastructure management\nProven experience with:\nSecure container deployment and Kubernetes best practices on AWS EKS\nLarge-scale SQL databases (e.g. PostgreSQL, MySQL)\nReal-time queue systems (e.g. Kafka, SQS, Temporal)\nOpinionated about improving developer experience through tooling, automation, and workflows that accelerate and up-level the engineering team around you\nYou are a great fit if\nYou have experience with our tech stack: AWS, Terraform, TypeScript, Redis, Node, Postgres\nYou consider yourself a swiss army knife engineer who can flex into infrastructure problems related to backend services, data pipelines, and web products.\nYou care deeply about performance and feel immense satisfaction driving latency of critical services down\nYou bring an SRE’s toolkit of experience, with strong opinions on how to invest in on-call and incident management practices to ensure system reliability.\nYou have hands-on experience scaling early systems from 1 → 10 in a fast-paced, high-growth environment\nYou thrive on working alongside exceptional teammates and derive energy from collaborative environments\nWhat we offer\nImpact:\nBe at the forefront of AI-augmented care delivery, tackling some of the most ambitious challenges in healthcare.\nGrowth:\nProfessional development and leadership opportunities within a rapidly expanding tech-enabled care delivery organization.\nExposure:\nGain hands-on experience in scaling a fast-growing healthcare technology company and directly interface with executives at the world’s leading healthcare organizations.\nCompensation:\nCompetitive salary and equity options.\nBenefits\n: Competitive healthcare, vision, and dental, snacks and free lunch at the office."
  },
  {
    "url": "https://jobs.ashbyhq.com/vanta/2381d292-48b1-4638-a735-fd23802f6ca4",
    "company": "Vanta",
    "job_title": "Senior Software Engineer, Applied AI",
    "location": ", , USA",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": "$180,000 - $244,000 USD",
    "date_posted": "2025-01-10",
    "description": "At Vanta, our mission is to help businesses earn and prove trust.\nWe believe that security should be monitored and verified continuously, and we empower companies to practice better security and prove it with ease. Vanta has a kind and talented team, and while some have prior security experience, many have been successful at Vanta without it.\nAs a Senior AI Applied engineer at Vanta, you will play a crucial role in shaping Vanta’s AI offerings, improving our systems, and setting technical strategy for our end-to-end ML/AI architecture. You’ll be part of the core AI team, working alongside a multidisciplinary group of product engineers, machine learning engineers, product managers, and security and compliance experts to implement, scale, and maintain data pipelines that accelerate AI innovations. In this role, you’ll build solid infrastructure foundations and high-leverage developer tools that empower Vanta’s engineers to create and enhance high-quality AI products efficiently.\nVisit our\nVanta Engineering Blog\nto learn more about what our team is working on!\nWhat you’ll do as an AI platform engineer at Vanta:\nTeam up with product engineering teams to design and implement AI-powered features to deliver customer value and integrate LLM models with the existing products and systems\nWork closely with other engineers at Vanta to understand their pain points in AI development and identify opportunities for improvements\nDesign, build, and improve AI infrastructure and tooling to unblock product strategy\nMake effective tradeoffs that consider business priorities, user experience, and a sustainable technical foundation\nSet an example for effective, collaborative engineering culture, and help mentor junior team members\nHow to be successful in this role:\nAt least 5 years of industry experience as a software engineer\nYou have knowledge in designing, developing, and deploying applications leveraging LLM models and systems, with a strong focus on Prompt Engineering, Fine Tuning, RAG implementation and Agentic frameworks\nYou have experience designing, building, and scaling full-stack applications, including backend systems, APIs, and frontend interfaces\nYou understand how to improve ML systems, creating eval sets, and driving quality hill-climbing\nYou are comfortable operating up and down the stack: frontend, API, backend, and database\nYou have worked at rapidly scaling startups and large companies, especially with environments that prioritize a bias for action\nYou are action-driven, willing to roll up your sleeves and engage directly with users. While you bring strong opinions, you prioritize building a platform that meets users where they are\nWhat you can expect as a Vantan:\nIndustry-competitive compensation\n100% covered medical, dental, and vision benefits with dependents coverage\n16 weeks fully-paid parental Leave for all new parents\nHealth & wellness and remote workplace stipends\nFamily planning benefits through Carrot Fertility\n401(k) matching\nFlexible work hours and location\nOpen PTO policy\n11 paid holidays in the US\nOffices in SF, NYC, Dublin, and Sydney\nTo provide greater transparency to candidates, we share base pay ranges for all US-based job postings regardless of state. We set standard base pay ranges for all roles based on function, level, and country location, benchmarked against similar-stage growth companies. Final offer amounts are determined by multiple factors and may vary based on candidate location, skills, depth of work experience, and relevant licenses/credentials\n#LI-remote\nAt Vanta, we are committed to hiring diverse talent of different backgrounds and as such, it is important to us to provide an inclusive work environment for all. We do not discriminate on the basis of race, gender identity, age, religion, sexual orientation, veteran or disability status, or any other protected class. As an equal opportunity employer, we encourage and welcome people of all backgrounds to apply.\nAbout Vanta\nWe started in 2018, in the wake of several high-profile data breaches. Online security was only becoming more important, but we knew firsthand how hard it could be for fast-growing companies to invest the time and manpower it takes to build a solid security foundation. Vanta was inspired by a vision to restore trust in internet businesses by enabling companies to improve and prove their security. From our early days automating security monitoring for compliance standards like SOC 2, HIPAA and ISO 27001 to creating the world's leading Trust Management Platform, our vision remains unchanged.\nNow more than ever, making security continuous—not just a point-in-time check— is essential. Thousands of companies rely on Vanta to build, maintain and demonstrate their trust— all in a way that's real-time and transparent."
  },
  {
    "url": "https://jobs.ashbyhq.com/kit/59838538-1033-4504-81b0-74d4372ea128",
    "company": "Kit",
    "job_title": "Senior Software Engineer II - Ecosystem",
    "location": "United States",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": "$181,000 - $181,000 USD",
    "date_posted": "2025-09-23",
    "description": "Kit\nis an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn't a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products — all within one platform.\nMore importantly, there isn't a team more committed to helping creators earn a living. We're on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote.\nWe are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team. We're also embracing AI thoughtfully — both in how we build and how we hire to ensure our team is adaptable, innovative, and ready for what's next.\nThe role\nWe're looking for a Senior Software Engineer II to lead the evolution of our extensibility and automation platform that powers how creators customize Kit to their unique needs.\nYou'll be joining the Ecosystem team, which owns the\nKit App Store\n,\ndeveloper platform\n(APIs, plugins, webhooks, OAuth), and automation suite that enables creators to build sophisticated, automated marketing systems. We're a newly forming team tackling both legacy modernization and greenfield opportunities, so your enthusiasm for building resilient teams and transforming brown-field systems into elegant solutions is essential.\nYou're a full-stack, product-minded engineer with deep expertise in Ruby on Rails and React, not content with just shipping features but playing the long game. You see our developer platform not as a technical requirement but as the foundation that empowers thousands of creators to extend Kit in ways we haven't imagined. You combine technical depth with leadership and extreme ownership, partnering closely with Product and Design to shape both the \"what\" and the \"how\". You thrive in ambiguity, take initiative without waiting for permission, and elevate everyone around you through your generosity and optimism.\nMost importantly, you understand that great developer experiences create compounding value: when we make it easier for others to build on Kit, we accelerate the entire creator ecosystem.\nYour support system\nYou'll report to the\nEngineering Manager\nwho leads the Ecosystem team, a cross-functional product team at Kit. You'll collaborate closely with a\nProduct Manager, Product Designer, and peer Software Engineers\n.\nYou’ll also have access to a group of Engineers across Kit for support and mentorship, and will start with a peer onboarding buddy who will help you navigate our systems and codebase.\nWhat you'll do\nFirst Week:\nDive into our codebase and extensibility and automation architecture. Set up your local environment and merge your first production code. Take part in Get To Know You's to meet our distributed team.\nFirst Month:\nWork through your personal onboarding plan. Begin understanding how Kit App Store supports creators from small to large, and identify opportunities for improvement. Join team activities for planning, building, and measuring the experiences we ship to creators. Actively participate in code reviews, and contribute PRs weekly.\nFirst Six Months:\nLead and architect at least one major feature from ambiguous idea to launch. Transform our legacy codebase through strategic refactoring while applying systems thinking to enhance scalability and maintainability. Drive adoption of patterns and conventions that elevate team-wide technical standards. Ensure service reliability by participating in on-call rotations. Present at least one Lunch & Learn session. Actively mentor peers, and champion quality across our codebase.\nWhat will S.E.T. you up for success\nSkills\nDeep expertise developing full-stack web applications using both Ruby on Rails and React, with a track record of owning features end to end\nAbility to write high-quality, well-tested, performant, and accessible code that balances speed of delivery with long term maintainability with minimal guidance\nSupport strategic product decisions by anticipating business needs and translating them into technical solutions\nCommunicate highly effectively across Engineering, Product, and Design to maintain alignment and momentum across complex initiatives\nChampion technical health through proactive monitoring, creating dashboards and alerting systems that identify issues early and drive systematic improvements\nAbility to lead without authority, aligning teams on goals, trade-offs, and success criteria\nExperiences\nLed major cross-team initiatives from ambiguous requirements to successful delivery with measurable business impact\nModernized and improved existing systems through hands-on brown-field development\nMade data-driven decisions throughout the product development lifecycle\nWorked transparently by sharing progress, learnings, and seeking feedback early and often\nDelivered features that directly impacted customer success and business goals\nTraits\nModel continuous growth while developing others through mentorship, code reviews, and deliberate knowledge sharing\nBalance pragmatism with strategic thinking, creating clarity and momentum for teams in uncertainty\nChampion creative execution by breaking down complex challenges into achievable steps others want to follow\nPioneer AI adoption strategies that thoughtfully balance experimentation with practical team enablement\nAct as a force multiplier by building systems, tools, and knowledge-sharing practices that make the entire team more effective\nShape and champion solutions that deeply align with user needs, balancing technical excellence with product impact\nNice to haves\nYou will stand out if you have:\nDesigned and scaled frameworks used by developers, like RESTful API platforms with versioning or OAuth app scopes\nEstablished thought leadership through conference talks, technical blogs, or significant OSS contributions\nBuilt successful products or partnerships within the creator economy ecosystem\nWhat won't set you up for success\nStruggling to operate in evolving problem spaces without established processes or guardrails\nPreferring to work solo or stay purely technical\nNeeding full consensus or permission before moving forward\nUncomfortable with direct feedback culture (both giving and receiving)\nPrioritizing technical perfection over pragmatic business solutions\nWorking hours and location\nWe're 100% remote with team members across the globe. We work mostly on East Coast time—so if you're based on the West Cost of the United States, Europe, or Asia, you might have a few early mornings or late evenings. We do our best to keep things reasonable, but a little time zone juggling comes with the territory.\nCompensation + perk + benefits\nKit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at our level L4 ($181,000/year). Level is determined based on experience and our interview process.\nPerks + benefits include:\nProfit Sharing\nKit equity\n401k with a 5% match\nWe cover up to $1,950 per month toward medical premiums, with dental and vision premiums fully covered. We offer Health Insurance plans through Aetna.\n$4,000 equipment allowance for your first two years, $3,000 budget every following two years\nIndividual learning + development budget ($3,500/year)\nGender affirming benefits\nChildcare benefit up to $3,000 annually\nTwenty (20) days of paid time off during each year of employment\nPaid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work\nTen (10) paid holidays a year\nTwo weeks of paid sick time each year, including mental health + well being days\nTwelve (12) weeks paid parental leave and flexible scheduling in your child’s first year\nUp to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months\nWinter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.\nEssential support services remain available, with teams coordinating to ensure coverage during this period\nFour-week, paid sabbatical after five years with the team\nFantastic in-person or virtual retreats with the team twice a year\nHow to apply\nWe know that most people hate interviewing (we relate!). We aim to make it as good of an experience as we can, and part of that includes keeping you informed during the process.\nHere’s what you can expect from the process:\nA phone screen with our recruiter\nHiring manager interview\nTake-home assignment\nA technical interview\nTechnical execution and leadership interview\nTo get started, complete this application, including answers to the questions on the next page.\nWe read every single application, and your responses to our application questions help put your experience into context.\nWe’ll keep you informed through every step\nKit is an equal opportunity employer\nWe value diversity in all of its forms. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply.\nWe’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.\nKit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits."
  },
  {
    "url": "https://jobs.ashbyhq.com/count/53b6685b-2500-4556-90b5-19c13c945551",
    "company": "Count",
    "job_title": "Senior Software Engineer - Data",
    "location": "London, London, United Kingdom",
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": "$100,000 - $120,000 GBP",
    "date_posted": "2025-10-17",
    "description": "About us\nWe are a fast-growing team on a mission to reimagine analytics and make data accessible to all.\nThe Count canvas combines the power of data notebooks with the collaborative workflow of digital whiteboards. We’re often referred to as the “Figma for data” because of the way Count transforms the way data teams work with the wider business through greater transparency and trust.\nSince launching in September 2022 we have seen the canvas concept explode, with Count empowering some of Europe’s leading tech companies — including Cleo, BeautyPie, TooGoodToGo and Omnipresent — to revolutionise how their teams understand and work with data.\nWhat you'll do\nWe’re looking for an exceptional software engineer to help shape Count’s next stage of growth. You'll own technical projects at the intersection of software development, data engineering, analytics and DevOps infrastructure, playing a key role in automating and scaling processes that empower every team across the organisation. Your responsibilities will include:\nScaling our Go-To-Market (GTM) stack\n: Work closely with our GTM team to automate our go-to-market activities, by integrating our marketing, sales and finance tools with our CRM and product.\nOwning Count’s analytics\n: Develop and maintain our core data infrastructure and data models to ensure the marketing, customer success and product teams have access to meaningful and accurate metrics.\nDriving operational efficiency via automation and AI\n: Build scalable processes powered by AI agents and automation tooling. Continuously remove manual intervention from workflows to drive outsized outcomes across the business.\nWe'd love to hear from you if you:\nHave at least 4 years of professional experience as a backend/platform engineer\nHave deep expertise in Python and building reliable data-focused backend services\nHave hands-on experience with cloud infrastructure (GCP/AWS/Azure), infrastructure-as-code (Terraform), containerisation (Docker/k8s) and data pipelines (SQL, dbt, Airbyte)\nLove automation, process improvement and finding ways to help others work efficiently\nAre comfortable working autonomously and taking responsibility for the delivery of large technical projects\nAre eager to learn from others and collaborative in helping others learn\nOur interview process will cover:\nAn initial discussion (30-45 mins) for you to ask any questions you have about Count and for us to learn more about your experience and interests\nA working session with two engineers (90-120 mins), where we'll dive into the stack and work with you through a technical challenge that we have faced recently\nA final meeting with our founders (45-60 mins)\nThe working session and final meeting will take place either virtually or in London, depending on where you're based.\nLife at Count\nCount is a remote-first company. Most of our team is based in the UK and we use our office in London as base to meet and collaborate. However we believe great work can happen anywhere and we’re happy to consider candidates from elsewhere in Europe.\nOur work is important to us, and we know we work best when we actively maintain a good work-life balance. We're backed by some of Europe's best investors allowing us to offer a competitive employment package. Some of the benefits of working at Count include:\nCompetitive salary, pension and share options\nFlexible working hours\n28 days of holiday (plus public holidays)\nPrivate health care\nGenerous parental leave\nAn annual working from home allowance and co-working budget\nQuarterly meetups with the team to relax and brainstorm, each time in a different city\nWe're committed to building a diverse team. Whatever your race, religion, colour, national origin, gender, sexual orientation, age, marital status or disability, we want to hear from you."
  },
  {
    "url": "https://jobs.ashbyhq.com/river/07bd8af6-a190-4601-a0d1-f20d0a01a089",
    "company": "River",
    "job_title": "Senior Software Engineer ",
    "location": null,
    "job_type": "Onsite",
    "employment_type": "Full-time",
    "salary": "$150,000 - $220,000 USD",
    "date_posted": "2024-10-28",
    "description": "At River we are building the world’s most trusted financial institution to empower people to take ownership of their financial lives through Bitcoin, the world’s only incorruptible digital money. We believe in a future where every person will have bitcoin savings, and every business will have bitcoin on the balance sheet. We obsessively design and build delightful products that help our clients buy, sell, secure, and use Bitcoin.\nWe are looking for a senior candidate who is comfortable across the entire web stack and has experience building and maintaining production systems at scale. This person will be building features that our clients use every day. Our web stack consists of Elixir, React, and Postgres.\nRiver is growing quickly and has raised more than $50 million from leading investors, including Goldcrest, Kingsway, Polychain, M13, DG, and Valor. We have also released our\ncompany's financials\nand\nproof of reserves\npublicly, so all of our clients and employees can verify the robustness and growth of the business themselves.\nWhat you will be doing\nArchitect and develop new features and products in the Elixir codebase powering our web applications and API\nWork closely with product management to plan and scope new projects and initiatives\nWrite high-quality, tested code\nParticipate in code-reviews\nHelp shape the culture of the engineering organization for years to come\nWhat we look for in you\n4+ years of experience in software engineering\nYou have designed, built and maintained production services at scale and understand how to build reliable systems\nYou write high-quality, reliable code and take ownership of systems you work on\nYou have experience developing solutions to ambiguous problems\nYou're excited about what we are building at River\nYou have a solid understanding of web security fundamentals\nNice to haves\nFintech experience\nYou have worked with Elixir, React, Kubernetes, and Postgres\nYou have worked at a rapidly scaling company\nInterest in Bitcoin\nLocation & Salary\n100% remote option available within the Americas and Europe, with offices in SF, NYC, and Columbus\nSalary range between $150,000 - $220,000 based on skills and experience\nSignificant equity stock options\nMedical, Dental and Vision Benefits\nUnlimited PTO\nParental Leave separate from regular PTO policy\n401k"
  },
  {
    "url": "https://jobs.ashbyhq.com/phantom/02c68924-988c-4195-a367-3bfce929df3a",
    "company": "Phantom",
    "job_title": "Senior Software Engineer, Frontend",
    "location": null,
    "job_type": "Remote",
    "employment_type": "Full-time",
    "salary": null,
    "date_posted": "2025-10-30",
    "description": "Phantom is revolutionizing the way millions of people interact with the crypto ecosystem. Our self-custodial wallet offers a seamless, unified experience for managing accounts and tokens across Solana, Bitcoin, Ethereum, and Polygon, empowering users with a single, convenient solution. By integrating cutting-edge security features and launching innovative tools for an enhanced personalized user experience, Phantom is able to provide a next-generation, safe and easy to use self-custodial wallet for everyone. This strategy has allowed Phantom to achieve significant milestones including surpassing 7 million MAU’s, reaching #1 in the Google play store finance category, and consistently trending as a Top 50 app across all categories, right next to X, PayPal, Coinbase, and ChatGPT.\nResponsibilities\nSenior Frontend Engineer obsessed with delivering exceptional UX quality — crisp visuals, smooth transitions, and intuitive flows — while staying pragmatic about shipping fast and iterating.\nYou know when to polish and when to push.\nYou care deeply about reliability, testing, and performance, but you’re also a great communicator who brings designers, PMs, and backend engineers together to move quickly without breaking trust.\nYou’ll own the core user experiences and help make Phantom feel world-class and trustworthy.\nQualifications\nBachelors degree in Computer Science or related technical field or equivalent practical experience\nReact + TypeScript, modular component design, state management (Zustand / Redux).\nAutomated testing (Jest, Maestro, Detox).\nPerformance tuning, error monitoring (Sentry, metrics).\nStrong UX collaboration with Design and PM.\nOwnership mindset — moves from definition → delivery → quality.\nPrevious experience working in fintech or crypto enviroments.\nHas shipped high-quality products and worked in high-caliber software development organizations.\nNice-To-Have\n: 1+ years experience in a blockchain based product\nWhy Work with Us\nOpportunity\nWe are a team of experienced builders in the blockchain and crypto industry. Our journey began from users seeking an easy, seamless path to accessing the crypto ecosystem. This passion fueled our exponential growth, allowing us to onboard over 7M+ active users in just over three years; with our user base growing weekly. Our dedication to a secure and seamless user experience has made us the leading wallet on Solana as well as our multi-chain approach enhances our platform's versatility, meeting the needs of a diverse and growing user base. By staying at the forefront of technology and user expectations, we continue to innovate and set industry standards on self-custodial crypto wallets.\nThere has never been a better time to work in crypto to help shape the future of innovation with a focus around the wallet experience!\nFirst impressions matter:\nWallets are responsible for a users first impression with crypto and onboarding new users into crypto. By ensuring that a user has a great first-time experience with crypto, we can help supercharge the growth of the entire ecosystem.\nMake crypto easier to navigate:\nThere is no easy way for a user to discover and navigate all that crypto has to offer. Wallets have a unique opportunity to help users not only onboard to crypto but also stay retained by exploring new things to do.\nWe live in a multi-chain world:\nWe currently support Solana, Ethereum, Polygon and Bitcoin with more networks to come in the new future. We are focused on creating a unified, multi-chain crypto experience for users.\nBenefits\nCompetitive salary and equity\nComprehensive insurance (medical/dental/vision) — 100% covered\nStipend for your ideal remote set-up\nFlexible hours and a supportive remote environment\nUnlimited vacation: Take time when you need it (and we really mean it!)\n401(k) retirement plan\nMonthly wellness benefit\nWeekly meal benefit\nGlobal off-sites\nWe strongly encourage candidates of all different backgrounds to apply.\nWe believe that our work is stronger with a variety of perspectives, and we’re eager to further diversify our company. If you have a background that you feel would make an impact at Phantom, please consider applying. We’re committed to building an inclusive, supportive place for you to do the best work of your career.\n#LI-DNP"
  },
  {
    "url": "https://jobs.ashbyhq.com/benepass/23e14d50-7e59-4a6e-86c7-f30d49e1f320",
    "company": "Benepass",
    "job_title": "Senior Software Engineer",
    "location": null,
    "job_type": "Onsite",
    "employment_type": "Full-time",
    "salary": null,
    "date_posted": "2025-08-21",
    "description": "About Us\nAt Benepass we're making benefits easy. We believe people are the most important asset to any company. Traditional one-size-fits-all benefits packages no longer cut it in today's hybrid and remote-first environment. With Benepass, companies can tailor their benefits to the unique needs of their workforce.\nThrough our easy-to-use and highly customizable fintech platform, People teams can implement, administer, and track the benefits that meet employees where they are. Employers design their benefits and perks plan by setting a contribution amount and eligible spend categories. Every employee has their own individual definition of wellness and needs different things to help them be their most productive, fulfilled self.\nOur Mission\nHelping companies reimagine how companies take care of their people.\nOur Investors\nWe are backed by leading investors, including Portage Ventures, Threshold Ventures, Gradient Ventures, Workday Ventures, and Clocktower Technology Ventures. To date, the company has raised $35 million of equity capital.\nArticles\nFounder Story - Jaclyn Chen\nBenepass Raises $20M\nCandidate Resources\nBenepass | Candidate Resource Page\nBenepass Listed on Inc. Magazine's Best Workplaces of 2023\nTEAM & ROLE\nBenepass is scaling rapidly, and the complexity of our product surface demands senior engineers who can bridge product vision and technical execution. This role exists to own the “zero-to-one” stage — shaping product approach in collaboration with PMs, Designers, and other engineers, defining the right technical strategy, and driving execution to delivery.\nThis Senior Software Engineer I will be an impact multiplier: leading architecture for initiatives, breaking down large ideas into clear technical approach documents and milestones, and mentoring other engineers while raising our technical bar. While they will contribute across the stack, they will have a heavier focus on backend systems — including our ledger, syncs, decisioning engine, and rules engine — with the ability to dive into frontend (React, TypeScript) work when needed.\nYou will:\nPartner early in product discovery with Product, Design, and engineering leaders to clarify goals, evaluate options, and recommend a technical approach.\nLead the creation of technical approach documents that define architecture, system interactions, trade-offs, and execution plans.\nGuide teams through execution of agreed-upon approaches, ensuring work is delivered with high quality, precision, and in a timely manner.\nTake ownership of backend-heavy initiatives (ledger, syncs, decisioning engine, rules engine) while contributing to frontend features when needed.\nBring forward strong architectural ideas, evaluate trade-offs, and influence system direction.\nProvide technical leadership and mentorship to mid-level and senior engineers.\nIdentify and drive improvements to system stability, performance, developer experience, and engineering practices.\nROLE LOCATION & TRAVEL\nYou will be expected to attend company-wide on-site events three times per year.\nOUR TECHNOLOGY AND STACK\nPython, Django, Django Rest Framework, GraphQL, PostgreSQL, JavaScript/TypeScript, React, Tailwind CSS, React Native, AWS, Docker.\nABOUT YOU\nProduct & Architecture Leadership\nPartners closely with Product, Design, and other engineers to translate ambiguous ideas into actionable, valuable solutions.\nShapes technical direction early in the discovery process, evaluating multiple approaches and trade-offs.\nRegularly authors technical approach documents for complex initiatives, aligning architecture with business goals.\nEnsures architecture decisions balance user needs, speed of delivery, and long-term maintainability.\nTechnical Excellence\nDesigns and implements well-structured, maintainable code in Python/Django and React with minimal guidance.\nBuilds robust APIs and UIs that meet scalability, performance, and security standards.\nExperienced in high domain complexity systems — e.g., financial ledgers, multi-system data syncs, rules/decisioning engines — with the ability to identify edge cases and ensure correctness.\nUses appropriate design patterns and abstractions to reduce complexity without over-engineering.\nWrites automated tests at the right level (unit, integration, E2E) and maintains high coverage.\nOwnership, Initiative & Problem Solving\nOperates with a high degree of self-direction, moving projects forward without needing detailed instructions.\nAnticipates edge cases and proactively addresses technical debt.\nUnblocks themselves and others through research, experimentation, and creative solutions.\nChampions improvements in product and engineering practices.\nCollaboration & Mentorship\nFacilitates cross-functional alignment during the design phase, ensuring engineering considerations are represented.\nReviews code for clarity, maintainability, and adherence to standards.\nMentors mid-level and senior engineers through pairing, feedback, and technical guidance.\nCommunicates progress, risks, and decisions clearly across teams.\nExecution & Impact\nConsistently delivers on time with work that meets defined acceptance criteria.\nImproves team efficiency by suggesting and implementing process or tooling enhancements.\nIdentifies opportunities to improve system stability, performance, or developer experience.\nContributes to documentation and runbooks that support smooth onboarding and maintenance.\nREQUIREMENTS\n5+ years of professional software engineering experience, including full stack development.\nProven experience shaping product direction and technical approach from early idea to delivery.\nProficiency in Python/Django, PostgreSQL, and React/TypeScript.\nStrong system design skills, including scalability, performance, and security considerations.\nExperience working on high domain complexity systems such as financial ledgers, multi-system data syncs, rules/decisioning engines, or similarly complex architectures.\nComfortable with cloud-based environments (AWS preferred) and CI/CD workflows.\nDemonstrated alignment with Benepassʼs engineering values and collaborative culture.\nPassionate about leveraging AI as a force multiplier to deliver high-quality results with greater efficiency.\nCOMPENSATION\nBase salary of $195,000 to $215,000 + equity.\nRange(s) are subject to change. Benepass takes a number of factors into account when determining individual starting pay, including your expectations, how you interview, peer compensation, and years of experience. We also look at the market data.\nRange(s) is subject to change. Benepass takes a number of factors into account when determining individual starting pay, including market comparables, interview performance, peer compensation, and years of experience.\nWhat We Offer\n95% coverage of medical, dental, and vision\nFantastic benefits (of course 😃), including:\n$250 WFH setup\n$150/month cell phone + internet\n$100/month Wellness\nWe offer several team onsites a year\nFlexible PTO\nAt Benepass, we are working towards reimaging how companies take care of their people. We are committed to creating an inclusive environment for all our employees and are seeking to build a team that reflects the diversity of the people we hope to serve with our revolutionary products. Benepass is proud to be an equal-opportunity employer."
  }
]